rails6/CodingCasts/autocomplete_ass/app/controllers/products_controller.rb

  def index
    # @products = Product.order("name").page(params[:page]).per_page(5)
    @products = Product.search(params[:search]).page(params[:page]).per_page(10)
---
SELECT  "products".* FROM "products" ORDER BY name LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "products" WHERE (name LIKE '%%')

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "price", "released_at", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["price", 44.0], ["released_at", "2019-12-30 00:00:00"], ["category_id", 1], ["created_at", "2019-12-30 06:31:10.786346"], ["updated_at", "2019-12-30 06:31:10.786346"]]

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]
UPDATE "products" SET "category_id" = ?, "released_at" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["category_id", 1], ["released_at", "2019-12-30 00:00:00"], ["updated_at", "2019-12-30 06:32:31.614907"], ["id", 1]]