rails6/CodingCasts/autocomplete_ass/app/controllers/searches_controller.rb

def create
  @search = Search.create!(search_params)
---
INSERT INTO "searches" ("keywords", "category_id", "min_price", "max_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["keywords", "cam"], ["category_id", 7], ["min_price", 3.0], ["max_price", 5.0], ["created_at", "2019-12-30 04:54:58.695841"], ["updated_at", "2019-12-30 04:54:58.695841"]]