rails6/CodingCasts/autocomplete_ass/app/models/product.rb

	def category_name=(name)
		self.category = Category.find_or_create_by(name: name) if name.present?
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Household Acessories"], ["created_at", "2019-12-31 01:03:59.116363"], ["updated_at", "2019-12-31 01:03:59.116363"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Fruits"], ["LIMIT", 1]]