rails6/CodingCasts/autocomplete_ass/app/views/products/_form.html.erb

    <!-- client side rendering, good for small database driven application
      <% f.text_field :category_name, data: {autocomplete_source: Category.order(:name).map(&:name)} %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC